Revit 2024 API
ParameterTypeId.RevealProfileParam Property
 "Profile"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RevealProfileParam { get; }
Visual Basic
Public Shared ReadOnly Property RevealProfileParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RevealProfileParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace